import re


def clean_meters_property_name(df):
    df["normalize_property"] = df["normalize_property"].str.replace(
        "((,\sтис.\sкуб.\sм.$|\s\(тис.\sм\d\s\)$|\s\(кв.м.\)$|\s\(кв.\s\dа\)$|,\sкм.$|,\sм.куб$|,"
        "\sкм$|\sкв.м$|\sм\d$|,\sкв.м$|,\sкуб.м$|,\sкуб.\sм$|,\sм$|,\sм.$|\s\d,\d*м,$|.\d\sм$|,\sм."
        "\sкв.$|,\sкв.\sм.$|,\sкв.м.$|\sкв.\sм.$|,\sм.п.$|,\sмм\d$|,\sкуб.м.$|,м\d$|,\sм.\sп.$|,\s\м\d|"
        "\sм.\sкуб$|,м$|,\sкв.\sм$|,\sм.кв.$|\s\(м.\)$|,\sп.м.$|\sкв.м.$|,\sм.кв$|\d\sМ$|,м\d,\sкв|,\s\d*\sм.кв$|"
        "\sм\sкв$|\s\d*м,\sшт$|\s\dх\d*\sмм\d$|,\sКВ.М.$|\s0,5\sмм\sоцинкований;$|\sм.кв$|,\s\d*м$|\sм.п.$|\d\s\d*см.$|"
        "\s\d\sсм$|,\sтис.куб.м.$|\s\d*мм$|,\sтис.м\d$|,\sпм$|\s\dм$|,\sМДж\/м\d$|,\sкв.м.*$|,\sкг\/кв.м$|"
        "\sтруба Д160,0мм, м.п$|\sкуб.м\/добу$|\sдо 25 м, 100кв.м$|\s\dх\d*мм2$|\s\dх\d*\sмм$|,\sм.п\s|\s\d*х\d*,\d*мм$|,\sкуб.\sм.$|"
        "\sм$|\s\d*.\dм\d$|\sд-50, 20, 25 мм$|,\sшт\/м\d$|,\sкуб.м\/рік$|\s\W-\d*х\d*,\d|sмм$|\s\(кв.м\)$|,кв.м$|\sмлн.куб.м.$|\s\dх\d*$|\sтис.м\d$|"
        "\sкм$|\s\d*\sМ.$|,\sшт.\/м\sх|\sКв.М$|,\sм.п.*$|,\sкв.\sм.|,м2\s.*$|\sм.$|\sм\d\/добу|\sтис.куб.м$|\sКУБ.М.$|\s\(кв.\s\d*.|\s\(куб.м.*|\sкуб.м$|"
        "\sкуб.м.|,\sм.куб.*$|,\sМ\d$|\,\s\d*кв.м$|\s\d*\sсм$|\sтис.м.\d*$|\sм.куб.$|\d*\s\d*м.куб.|\s\d*х\d,\d|\sмм|\s\(м\)$|,\sКМ$|\s\(м.куб\/годину\)$|\sкв.\s\d*.$|"
        "\s\(тис.\sм\d\s\)|,\sшт$|,м\d.$|,\sст.м\d\/годину$|,\s\d*м\d\s*.\sшт.$|\sм3\/рік$|,м.кв$|\sV-\d*м\d$|\sшт\/м2$|,\sВт\/м\d$|,\sшт.\/м\d$|,\d*м2$|\s\(м\d\/рік\)$|"
        "\sV=\d*м\d$|\sтис.\sм\d\s\/рік$|\sм\d\/доба$|,\sтис.м3\/рік$|,\sтис.\sм3\/год$|\sтис.кв.год.$|,м.\sкв.$|,\s\d*\sм2\\t$|\s\(\sм2\)$|\sм2\\t$|,\sнм3$|\sм\dтис.$|"
        "\sл\/м\d\s|\s-\d*\*\d,\dмм$|,мм$|,\sдіаметром\s\d*\/\d*мм$|\sт\/м\d$|,\sтис.кв.м.$|,кв.м.$|,\s\d*\sкв.м.\\t$|\(кв.м.\)\s|\d*\s\d*м\d\sшт.$|,\s\d*м\d$|\sнм\d\/рік$|"
        "\s\(\d*\sм\d\)$|\s\(\d.\d\sл\/м\d\)\s*т.$|(.\sкм.$)|\(\d*\sкг\/см2\)$|)|(,\sМ\W)$|(\sКв\W\d*)$|(\s\d.*)$|(\sКв.М\s*.*)|(\sТис.Кв.М\s*.*)$|(|,)(\sкуб.\sм\/)$|"
        "(|,)(\sкв.м.\\t)$|(|,)(\sл)$|(|,)(\sн\s.*)$|(|,)(\sд\d*\/\d*м)$|(|,)(тис.\/куб.)$|(|,)(\sд=\d*)$|(|,)(\s\(га\))$|)", "", flags=re.IGNORECASE)
    return df


def clean_energy_property_name(df):
    df["normalize_property"] = df["normalize_property"].str.replace(
        "((.\sтис.\sкВт\W\s(год.|год\/рік))$|(|,)(\sтис.(аВт\/рік|кВт\/год|кВт\/рік\W|кВт\/рік(кВт\/год||)|кВт\W\/год|кВт.\sгод|кВт|\sкВт\/год\/міс.$))$|"
        "((|,)\s(тис.\s|)(кВт|кВт\W|кВт.рік|кВт\/\sрік))$|(.\s(тис\W|тис\Wквтгод))$|((|,)\sтис.(\s|)кВт(\Wгод|\Wгод.))$|((|,)\sтис.квтгод)$|"
        "(\s\(.*\)$|\(.*\)$)|((|,)\sквт\Wгод\/рік)$|((|,)\s)тис.квт$|((|,)\sквт\/рік)$|((|,)\sкВт\/(рік|год))$|((|,)\s(квт\/міс|квт\Wгодин|кВт\Wгод.))$|"
        "(|,)(квт\Wгод|Квт.год.\/рік)$|((|,)(\sтис.кВт\sгод\/рік)$|\sтис.кВт\sрік)$|(\s*кВт.год.рік|(|,)(\sтис.кВт.год.рік)$)|(|,)(\sтис.кВт\Wг\/рік)$|"
        "\(.*\)$|(|,)\sкВА\/кВт$|(|,)\sкВт\W\sгод$|((|,)(\sтис.кВт\sчас\sв\sгод)$)|(|,)(\sтис.кВт)$|(|,)(\sт.кВт\Wгод\/рік)$|(|,)(\sтис.кВт\Wгодин)$|\s\d*кВт$|"
        "((|,)\sтис.\sкВт\W\sгод.\/рік$)||((|,)\sтис.\sкВт\W\s(год.\/рік|год))$|(|,)\s(гкал|гкал\/рік|тис.гкал)$|(\sмвт\/рік)$|(|,)((\sгдж|\sтис.\sгдж))$|"
        "()()$|(|,)(\sт.кв.\Wгод\/рік)$|(|,)(\sпог.м)$|(|,)(\sмвт.год\/рік)$|(|,)(\sмв\Wа)$|(|,)(\sмвт\/годин\/рік)$|(|,)(\sмвт.г)$|(|,)(\sмпа)$|"
        "(|,)(\sтуп)$|(|,)(\sт\/доба)$|(|,)(\sпл-10кв)$|(|,)(\sд)$|(|,)(\sтп)$|(|,)(\sд-\d*мм,\sн-\d*мм)$|(|,)(\sгр.\sприм.)$|(|,)(\sос.)$|(|,)(\/\sв\sрік)$|"
        "(|,)(\s[d]=\d*м)$|(|,)(\sрік)$|[М]$|(|,)(:\sщебінь)$|(:)$|(|,)(:.*)$|(|,)(\s[d]\W\d*)$|(|,)((\\ngsm\Wlte\W-900|\\ngsm\Wlte-900|\sgsm\Wlte\W900|\s\\numts-\d*))$|"
        "(|,)(\sпе\d*\ssdr\d*\sдіаметром)$|()()$|(|,)(\sехз)$|(|,)(\sppc)$|(|,)(\sпост)$|(|,)(\sом-\d*-\d*)$|(|,)(\sктп-\d*-\d*\/\d,\d*кв)$|(|,)((\sд-\d*мм|\sд-\d*\/\d*|\sд-\d*))$|"
        "((\sб|\sз|\sж|\sи|\s "'л'"|\s"'\W\d'"))$|(|,)((\sм\d*|\sф\d*|\sф\d*х\d*|\sф\d*х\d*,\d*))$|(|,)()$|(\slte\W\d*)$|(\sdcs\W\d*)$|(|,)((\\nprotherm\syaguar|))$|"
        "(\\nтиску\sel.sper\spress\Wsystem\s2xrx\s4-6\s\W\sinv\\neasy\skw)$|(\\n)$|(Збт ø)$|(\sø)$|(\Wдовжина\Wтраси.*)|(\shuawei.*)$|(\sшт)$|((\sб\W\d|\sс\W\d))$|"
        "(-д=\d*,\d*м, нр=\d*,\d*м)$|((\ssolis\W\d*k\W\dg|\ssolis\s\W))$|((\sк\d\sdn|\sк\d))$|(-(\sнижче|\sвище)\sпозн.)|((\sпп|\sпе))$|(|,)(\sгц)$|(|,)(\sмвт)$|"
        "(|,)(\sд=\d*\s\(\+\))$|(|,)(\sø.*)$|(|,)(\sмаш.)$|(Тксс-\d*)$|(Ктп-\d*\/\d*\/\d*,\d*)$|(|,)(\sвт)$|\s\(гкал\)$|)", "", flags=re.IGNORECASE)
    df["normalize_property"] = df["normalize_property"].str.replace(", тис.кВт час в год", "", flags=re.IGNORECASE)
    return df


def clean_area_property_name(df):
    df["normalize_property"] = df["normalize_property"].str.replace(
        "((\s№\d*\/\d*$|\s№\d*$)|(\sv)$|(|,)(\sга)$|(|,)(\sліт.\sд)$|(|,)(.№\d*)$|(|,)(\sметрів\sквадратних)$|"
        "(|,)(\s\(основна\sдорога\/\s.*)$|(|,)(тис.м.(куб.|куб))$|(|,)(\sтис.м.куб\/рік)$|(|,)(\sкуб.\sм)$|"
        "(|,)(\sтис.\/куб.м)$|(|,)(\sм.\sкуб.)$|(|,)(\sкуб.)$|(|,)(\sтис.куб.м\s*стіч.\sвод\/доб)$|(|,)(\sтис.\sкуб.)$|"
        "(|,)(\s\(тис.\sкуб.)$|(|,)(\sтис.куб.м\/рік)$|(|,)(\sтис.м.куб.\/рік)$|(|,)(\sтис.м.куб\/міс.)$|"
        "(|,)(\s(тис.куб.м\/день|тис.\sкуб.\sм\/рік))$|(|,)(\sм.куб)$|(|,)(\sм.кб)$|(|,)(\sліт.*)$|(|,)(\sе)$|"
        "(|,)(\sв\sт.ч.навіс)$|(|,)(\sду)$|(|,)(\s№.*)$|(|,)(-63.*)$|(|,)(\s\(га\))$|(|,)(\s‰)$|(|,)(\sкоеф.)$|"
        "(|,)(\s°c)$|(|,)(\sз\/б\sд=\d,\d)$|(|,)(\sліжко\/відвідув)$|(|,)((\sгол.|чол.|\sтис.\sчол.))$|(|,)(\(шт\))$|"
        "()()$|(|,)(\/рік)$|(|,)(\sе2-к\ssn16\sдіам.300)$|(|,)(Ктпг-.*)$|(|,)(\s\(\d.штучна\sтрава;)$|(|,)(\sз\sфе)$|"
        "(|,)((\sавтомоб.|\sавто.|\sавто))$|(\/)$|(|,)(\sліжко\/місць)$|(|,)(\s\(т1,т2\).*)$|(|,)(\sлюд.\/)$|(|,)(\sм.)$|"
        "(|,)(\sа)$|(\s\()$|(д-\d*х\d.*)$|(|,)(\sавббшв)$|(|,)(\sпос.)$|(|,)(\sпов)$|(Ктп-\d*\/.*)|(|,)(\sт1\sт2)$|(\/доба)$|(\sфе)$|)", "", flags=re.IGNORECASE)
    return df


def clean_money_property_name(df):
    df["normalize_property"] = df["normalize_property"].str.replace(
        "((|,)(\sшт\W)$|(|,)(\sтис.(\sгрн|\sгрн.|грн.|грн))$|"
        "(|,)((\s.\sгрн|\sгрн))$|(|,)(\sтис.грн.*)$|(|,)(\sосіб\/день)$|"
        "(|,)(\s(м\/місць|м\/м|машино\Wмісце|місць|л\/а|м.\Wмісць|м\Wм|))$|"
        "(|,)(\s(од.|од|осіб|осіб\/годину|сол.\/добу|місце|чол\W|чол\W\/змін|осіб\/добу|чол.\/год.|чол.|чол||люд\/доба|осіб\/год|чол.\/день|осіб\/зміну|))$|"
        "\s*\(пс$|(,|)(\sчол\/добу|\sчол\/д|\sчол\/зм|\sчол\/роб.день|\sчол\/д.|\sчол\/день|\sчол\/роб|\sчол\/година|\sчол\/годину|\sлюд\/годину|\sлюд\/год|люд\/год.|"
        "\s*відвідувачів на добу|\sавто.\/добу|\sхворих\/зміну|\sчол.\/добу|\sчол.\/зміну|\sголів\/рік|\sмашин\/добу|\sавто\/добу|.\sчоловік\/день|\sчол.\sза\sдобу|\sчол\/год|"
        "\sт\/рік|\sчол.\/год|\sт|\sшт\/доба|год|\sвідвідувань\sна\sгодину|.\sчоловік|\sосіб.\/добу|\sавто\/в\sдень|\sавтомашин\/добу|\sколектора\/год.|\sосіб\/доба|\sлюд|"
        "\s*чол\/год|\sтон\/рік|\sшт\/год|\sмісткість|.\sавто\/доба|\sчол.\/доб.|\sосіб\/год.|\sавто\/|\sлюд\/добу|\sосіб\/доб|чол\/доба|\sлюд\/день|\sвідвідувань\sна\sдобу|"
        "\sчоловік\/добу|\sмашин\/год.|\sавт\/добу|\sл\/доба|\sголів\sврх\/добу|\/|\sмаш\/добу|\sшт\/рік|\sлюд\/зміну|\sліжко\Wмісце|.\sлюдей\/день|\sчол\/зміну|\sпокупців\/зміну|"
        "\sштук|)$|(|,)(\sтис.т.)$|(|,)(\sтис.\sчол.\W)$|(|,)(\sтис.)$|(|,)()$|(|,)(\s\((тис.|тис.\sт)\))$|(|,)(\sтис.т.у.п.)$|(|,)(\sтис.т\/рік)$|(|,)(\sмаш.\/місць)$|(\,)(\/рік)$|"
        "(|,)(\sліжк-місце)$|(|,)(кг\/)$|(|,)(\sт\/час\sпара)$|(|,)(\sтн\/доба)$|)", "", flags=re.IGNORECASE)
    return df


def clean_weight_property_name(df):
    df["normalize_property"] = df["normalize_property"].str.replace(
        "((|,)(\sп)$|((|,)\sт)$|(|,)(\sтис.т)$|(|,)(\sтонн\/міс)$|"
        "(|,)(\sт\/)$|(|,)((\sтон|\s.\sтон))$|(|,)(\sкг)$|(|,)(\sкг\/добу)$|"
        "(|,)(\sкг\/\sдобу)$|(|,)(\sкг\/зміну)$|(|,)(\sкг\/гік)$|(|,)(\sі,\sгрн)$|"
        "(|,)(\s(г\d*|г))$|(|,)(тис.\sголів)$|(|,)(\s(тис.тонн|тис.ум.тон))$|(|,)((\sгдж|\sтис.\sгдж))$|"
        "(|,)(\sтис.тн.\/рік)$|(|,)(\sм.2)$|(|,)(\sпов.)$|(|,)(\sр.)$|(|,)(\sтонн\sв\sрік)$|(|,)(,шт.)$|"
        "(|,)(.\sп.м)$|(|,)(\sшт\/шт.)$|(|,)(\sп\/місць)$|(|,)(\sкомпл.)$|(|,)(\sмаса)$|(|,)(\sпог.)$|"
        "(|,)(\sт\/день)$|(|,)(\sод.\/рік)$|(|,)(\sтн)$|(|,)(\sкв.№.*)$|(|,)(\sтонн)$|(|,)((\sКв.|Кв.))$|"
        "(|,)(\sліжко-місць)$|(|,)(\sт.у.т.)$|(|,)(\/добу)$|(|,)(\sпог.м)$|(|,)(\sроків)$|()()$|(|,)(\sавт.\/добу)$|"
        "(|,)(\sпог.метр)$|(|,)(\sф\d*,\d*мм)$|(|,)(\sквар)$|(|,)(\sпб)$|(|,)(\sодиниць)$|(|,)(\sбокс)$|()()$|"
        "(|,)(\sтн.)$|(|,)(\sкв.*)$|(|,)(\sм.кв.)$|(|,)(\sод\/кв.м)$|(|,)(\sк-т)$|(|,)(\sкомпл)$|(|,)(\sтон\/доба)$|"
        "(|,)(,м.п)$|(|,)(\sцех)$|(|,)(\sтонн\/тиждень)$|(|,)(т.\sу.\sп.)$|(|,)(тис.)$|(|,)(тон\sв\sрік)$|"
        "(|,)(\sмісяців)$|(|,)(\sмашино-смісце)$|(|,)(\sмашино\/місць)$|(|,)(\sкм.м)$|(|,)(\sміс)$|(|,)(\sм.\sпог)$|"
        "(|,)(\sм\/с)$|(|,)(\sм.\Wмісце)$|(|,)(\s(місяці|місяць|міс.))$|(|,)(\sмаш\/місце)$|"
        "(|,)(\sмаса\sдо)$|(|,)(\sмаса(\sустаткування\sдо|\sустаткування))$|(|,)(\sкг.*)$|(|,)(\sкуб.\sм\/)$|"
        "(|.)(\sм.)$|)", "", flags=re.IGNORECASE)
    return df


sps = ["км", "км.", "км.пог.", "км.пог", "км.пог.м", "км.пог.метр",
       "км.пог.метрів", "км.пог.метрів", "км.пог.метрів", "Кв.м", "Кв.м.", "Кв.метр",
       "Квт.год", "Квт.год.", "Квт.год.м", "Квт.год.метр", "Квт.год.метрів", "Квт.год.метрів",
       "ква", "квА", "кв.А", "кв.а", "кв.а.", "кв.а.м", "кв.а.метр", "кв.а.метрів",
       "т", "тона", "тон", "тонн", "тонн.", "тонн.в", "тонн.в.рік", "тонн.в.рік", "тонн.в.рік",
       "місць", "місць.", "місць.в", "місць.в.рік", "місць.в.рік", "місць.в.рік",
       "місяців", "місяців.", "місяців.в", "місяців.в.рік", "місяців.в.рік", "місяців.в.рік",
       "маса", "маса.", "місце", "місце.", "місце.в", "місце.в.рік", "місце.в.рік", "місце.в.рік",]


# for i in wd:
#     if i in sps:
#         print(i)

meters = ["м", "м.", "м.пог.", "м.пог", "м.пог.м", "м.пог.метр", "кв.м",
          "км", "км.", "км.пог.", "м.куб", "куб.", "куб.м", "куб.метр", "м.куб.", "куб", "тис.м", "млн.куб.м.", "КУБ.М.", "м.куб.м", "м.куб.метр",
          "кв.метр", "КВ.М", "КВ.МЕТР","кв.м.", "кв.метр", "метр", "м3", "м2", "кв",
          "мм", "мм2", "тис.м", "тис.кв.год", "тис.м3/рік", "тис.м3", "тис.м2", "тис.м2/рік",
          "тис.м3", "тис.м/рік", "тис.м2", "тис.м", "нм", "Кв.М", "Кв.М", "м.п", "см", "см2", "тис.кв.м", "тис",
          "тис.кв.год.", "п.м.", "шт", "га"]

energy = ["квт/рік", "квт.год", "квт.год.", "квт.год.м", "квт.год.метр", "квт.год.метрів",
          "тис.кВт", "тис.аВт/рік", "тис.кВт/рік", "тис.кВт.год", "тис.кВт.год.", "тис.кВт.год.м",
          "кВт/рік", "кВт/год", "кВт/год/міс.", "тис.", "квт-год", "тис.квт", "квт/рік", "квт/міс",
          "тис.кВт час в год", "тис.кВт*годин", "мвт.год", "мвт.год/рік", "квт/міс", "квт/год/міс",
          "квт-годин", "Вт/год", "Вт", "вт", "гдж", "тис. гдж", "тис.гдж", "тис.гдж/рік", "тис.гдж/рік",
          "Ватт",
          ]

weight = ["т", "тон", "тонн", "тонн.", "тонн.в", "тонн.в.рік", "тонн.в.рік", "тонн.в.рік",
          "тис.т", "тис.тонн", "тис.тонн.", "тис.тонн.в", "тис.тонн.в.рік", "тис.тонн.в.рік", "тис.тонн.в.рік",
          "т/рік", "тонн/міс", "кг", "тис.тонн", "тис.ум.тон", "тонн в рік", "шт\шт.", "од.\рік", "тонн/рік",
          "м.2", "тис. голів", "грам", "г", "кг\міс", "кг\місяць", "кг\рік", "кг\год", "кг\годину", "кг\години",
          "год\год", "тон\доба", "тон\добу", "тон\доби", "тон\добу", "тон\доби", "тон\доби", "тон\доби",
          "маса", "маса.", "місце", "місце.", "місце.в", "місце.в.рік", "місце.в.рік", "місце.в.рік",
          "п\місць", "кв.№", "№", "пов.", "шт./рік"
          ]
wd = "8,25м2"

w = re.findall("(\sм\d*$|м\d*\W$|м.пог.$|М$|м.пог.м$|шт./м$|м.пог.метр$|кв.м$|кв.\sм$|км$|км.пог.$"
               "|м.куб|куб\W$|куб.м$|куб.\sм.$|куб.\sм$|куб.метр$|м.куб.|куб.м|\sм\Wкуб\W/год|тис.куб.м.$|куб|тис.м$|млн.куб.м.$|КУБ.М.$"
               "|м.куб.м$|м.куб.метр$|кв.метр$|КВ.М$|КВ.МЕТР$|кв.м\W|метр$|кв$|мм\d*$|"
               "|тис.кв.год|тис.м3/рік$|тис.м2$|тис.м2/рік$|тис.м3$|тис.м/рікнм$|Кв.М$"
               "|м.п$|см\d*$|тис.кв.м$|тис$|тис.кв.год.$|п.м.$|шт$|га$|Вт$|.шт.$|кВТ/шт$|млн.м\d*$|"
               "тис.м\d*$|тис.м.куб/рік$|м.куб./год$|куб/добу$|м.куб./рік$|а/м$|пог.м$|кВт$|кВт/год$|\sт$|\sтон$|тонн$|"
               "тонн.в$|тонн.в.рік$|тис.т$|тис.тонн$|тис.тонн.$|тис.тонн.в$|тис.тонн.в.рік$|т/рік$|"
               "тонн/міс$|кг$|тис.ум.тон$|тонн в рік$|тонн/рік$|м.2$|тис. голів$|грам$|\sг$|"
               "маса$|місце$|кг/міс$|тис.кВтгод|м.кв|тис. грн$|тис. кВт\Wгод|м\W$|років$|тис.грн$|тис.грн\W$|тис. грн\W$|од\W*$|"
               "\(га\)$|\(га\)\W$|\(Гкал\)$|\(тис. кВт \)$|\(тис. м3 \),$|\(тис. м3 \)$|\(тис. м3\)$|\(тис. т\)$|м\d\s\(.*\)$|"
               "міс.$|місяці$|голів$|міс$|люд/годину$|місяців$|\sкуб.м$|"
               "МІСЯЦЬ$|місяць$|чол.$|тис.кВт/год.$|тис.кВт/год$|куб.м\W.*$|маш.$|кВА$|пов.$|чол/дн$|осіб$|чол/доба$|учнів$|\sА$|авто$|"
               "мПа$|\(кВт\Wгод/рік\sтис.\sм3\)$|м.п.$|люд/доба$|чол./добу$|чол$|Гкал/год$|хворих/зміну$|Гкал$|осіб/добу$|"
               "\Wпов$|\W\sр\W$|\W\sр$|\sр.$|\(тис.\)\W$|\sМВт\Wгод$|\sчол./доба$|\sлюд/год$|\sкВ$|\sм\d/рік$|"
               "\sтис.т.$|\s\(Гкал\)\W$|\sл/с$|\sкВт\W$|тис\W\sгривень$|тис.люд.год.$|\sчол/добу$|"
               "\sмес$|\sмісць$|\sм3/година$|\sВт/м. кв.$|\sчоловік/день$|\sтон/година$|\sКВ\sМ.$|\(м\d/рік\)$|"
               "\sчол/день$|\sм/місць$|\sкомплект$|\sм2/т$|\sм\W\sкв\W$|ст$|\sповерхів$|м\d$|^м\d|\sм$|"
               "кв.метрів$|діб$|місяця$|тис.люд.-г.$|\sтис.місць$|\sмп$|\sлюд/дн|\sт.кВт\Wгод/рік$|"
               ")", wd)

w = [x for x in w if x != '']
d = ['']
print(len(d))

# print(w)

# nw = re.search("(м\d*$|м.пог.$|м.пог.м$|шт./м$|м.пог.метр$|кв.м$|кв.\sм$|км$|км.пог.$"
#                "|м.куб|куб.$|куб.м$|куб.метр$|м.куб.|куб|тис.м$|млн.куб.м.$|КУБ.М.$"
#                "|м.куб.м$|м.куб.метр$|кв.метр$|КВ.М$|КВ.МЕТР$|кв.м.|метр$|кв$|мм\d*$|"
#                "тис.кв.год|тис.м3/рік$|тис.м2$|тис.м2/рік$|тис.м3$|тис.м/рікнм$|Кв.М$"
#                "|м.п$|см\d*$|тис.кв.м$|тис$|тис.кв.год.$|п.м.$|шт$|га$|Вт|.шт.$|кВТ/шт$|млн.м\d*$|"
#                "тис.м\d*$|тис.м.куб/рік$|м.куб./год$|куб/добу$|м.куб./рік$|а/м$|пог.м$|кВт$|кВт/год$|\sт$|тон$|тонн$|"
#                "тонн.в$|тонн.в.рік$|тис.т$|тис.тонн$|тис.тонн.$|тис.тонн.в$|тис.тонн.в.рік$|т/рік$|"
#                "тонн/міс$|кг$|тис.ум.тон$|тонн в рік$|тонн/рік$|м.2$|тис. голів$|грам$|г$|"
#                "маса$|місце$|кг/міс$|тис.кВтгод|\sм.кв|тис. грн$|)", wd)
print(w)



